In [195]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [196]:
surgery_amt_avg_tbl = pd.read_csv('/Users/Janey_jiayan/Downloads/Humana_Data/surgery_amt_avg_tbl.csv')

In [197]:
surgery_most_recent_day_tbl = pd.read_csv('/Users/Janey_jiayan/Downloads/Humana_Data/surgery_most_recent_day_tbl.csv')

In [198]:
surgery_amt_avg_tbl.head()

    Unnamed: 0             id Avg_Amt_Spent_Surgery
0  event_descr            NaN               Surgery
1            0  ID10010854159                2314.0
2            1  ID10013863216              12337.42
3            2   ID1002482139              50042.33
4            3  ID10036954381                4643.0

In [199]:
surgery_most_recent_day_tbl.head()

    Unnamed: 0             id Most_Recent_Day_Surgery
0  event_descr            NaN                 Surgery
1            0  ID10010854159                    -421
2            1  ID10013863216                    -200
3            2   ID1002482139                    -742
4            3  ID10036954381                    -560

In [200]:
surgery_amt_avg_tbl = surgery_amt_avg_tbl.drop(surgery_amt_avg_tbl.columns[[0]], axis=1)

In [201]:
surgery_amt_avg_tbl.head()

              id Avg_Amt_Spent_Surgery
0            NaN               Surgery
1  ID10010854159                2314.0
2  ID10013863216              12337.42
3   ID1002482139              50042.33
4  ID10036954381                4643.0

In [202]:
surgery_amt_avg_tbl = surgery_amt_avg_tbl.drop(surgery_amt_avg_tbl.index[0])

In [203]:
surgery_amt_avg_tbl.head()

              id Avg_Amt_Spent_Surgery
1  ID10010854159                2314.0
2  ID10013863216              12337.42
3   ID1002482139              50042.33
4  ID10036954381                4643.0
5  ID10074598346                1452.0

In [204]:
surgery_most_recent_day_tbl = surgery_most_recent_day_tbl.drop(surgery_most_recent_day_tbl.columns[[0]], axis=1)

In [205]:
surgery_most_recent_day_tbl.head()

              id Most_Recent_Day_Surgery
0            NaN                 Surgery
1  ID10010854159                    -421
2  ID10013863216                    -200
3   ID1002482139                    -742
4  ID10036954381                    -560

In [206]:
surgery_most_recent_day_tbl = surgery_most_recent_day_tbl.drop(surgery_most_recent_day_tbl.index[0])

In [207]:
surgery_most_recent_day_tbl.head()

              id Most_Recent_Day_Surgery
1  ID10010854159                    -421
2  ID10013863216                    -200
3   ID1002482139                    -742
4  ID10036954381                    -560
5  ID10074598346                    -246

## Join two surgery tables

In [208]:
surgery_most_recent_day_tbl.shape

(5804, 2)

In [209]:
surgery_amt_avg_tbl.shape

(5804, 2)

In [210]:
joined_tbl_1 = surgery_most_recent_day_tbl.merge(surgery_amt_avg_tbl, on="id", how="inner")
joined_tbl_1.shape

(5804, 3)

In [211]:
joined_tbl_1.head(10)

              id Most_Recent_Day_Surgery Avg_Amt_Spent_Surgery
0  ID10010854159                    -421                2314.0
1  ID10013863216                    -200              12337.42
2   ID1002482139                    -742              50042.33
3  ID10036954381                    -560                4643.0
4  ID10074598346                    -246                1452.0
5  ID10125698107                    -515    13372.949999999999
6  ID10144726843                    -310               5395.34
7  ID10166893764                      -9    34370.840000000004
8  ID10167700196                    -428              41851.79
9  ID10169051312                    -385                 995.0

# Join another table

In [212]:
cnt_tbl_fin = pd.read_csv('/Users/Janey_jiayan/Downloads/Humana_Data/cnt_tbl_fin.csv', header=1)

In [213]:
cnt_tbl_fin.head()

,event_descr,Unnamed: 1,Fully Paid Claim,Inbound Call by Mbr,Inbound Call by Prov,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension,Surgery
0,0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0
1,1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
2,2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0
4,4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0

In [214]:
cnt_tbl_fin.shape

(13990, 11)

In [215]:
cnt_tbl_fin.columns

Index(['event_descr', 'Unnamed: 1', 'Fully Paid Claim', 'Inbound Call by Mbr',
       'Inbound Call by Prov', 'New diagnosis - CAD', 'New diagnosis - CHF',
       'New diagnosis - CPD', 'New diagnosis - Diabetes',
       'New diagnosis - Hypertension', 'Surgery'],
      dtype='object')

In [216]:
cnt_tbl_fin = cnt_tbl_fin.rename(columns={"Unnamed: 1":"id"})

In [217]:
cnt_tbl_fin.head()

,event_descr,id,Fully Paid Claim,Inbound Call by Mbr,Inbound Call by Prov,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension,Surgery
0,0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0
1,1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
2,2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0
4,4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0

In [218]:
cnt_tbl_fin = cnt_tbl_fin.drop(cnt_tbl_fin.columns[[0]],axis=1)

In [219]:
cnt_tbl_fin.head()

,id,Fully Paid Claim,Inbound Call by Mbr,Inbound Call by Prov,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension,Surgery
0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0
1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0
4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0

In [220]:
cnt_tbl_fin.dtypes

id                               object
Fully Paid Claim                float64
Inbound Call by Mbr             float64
Inbound Call by Prov            float64
New diagnosis - CAD             float64
New diagnosis - CHF             float64
New diagnosis - CPD             float64
New diagnosis - Diabetes        float64
New diagnosis - Hypertension    float64
Surgery                         float64
dtype: object

In [222]:
joined_tbl_1.head()

              id Most_Recent_Day_Surgery Avg_Amt_Spent_Surgery
0  ID10010854159                    -421                2314.0
1  ID10013863216                    -200              12337.42
2   ID1002482139                    -742              50042.33
3  ID10036954381                    -560                4643.0
4  ID10074598346                    -246                1452.0

In [223]:
joined_tbl_2 = cnt_tbl_fin.merge(joined_tbl_1, on="id", how="outer")

In [224]:
joined_tbl_2.shape

(13990, 12)

In [225]:
joined_tbl_2.head()

,id,Fully Paid Claim,Inbound Call by Mbr,Inbound Call by Prov,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension,Surgery,Most_Recent_Day_Surgery,Avg_Amt_Spent_Surgery
0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0,-421,2314.0
1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,-200,12337.42
2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN
3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0,-742,50042.33
4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN

## Join the last table

In [226]:
amt_agg_tbl = pd.read_csv('/Users/Janey_jiayan/Downloads/Humana_Data/amt_agg_tbl.csv', header=1)

In [227]:
amt_agg_tbl.shape

(13910, 8)

In [228]:
amt_agg_tbl.head()

,event_descr,Unnamed: 1,Fully Paid Claim,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension
0,0,ID10010854159,23227.94,0.0,0.0,0.0,0.0,0.0
1,1,ID10013863216,18282.46,0.0,0.0,0.0,0.0,0.0
2,2,ID10024447278,3126.90,0.0,0.0,0.0,0.0,0.0
3,3,ID1002482139,136843.88,137.0,0.0,137.0,0.0,0.0
4,4,ID1003386406,76559.83,0.0,0.0,0.0,0.0,0.0

In [229]:
amt_agg_tbl = amt_agg_tbl.drop(amt_agg_tbl.columns[[0]], axis=1)

In [230]:
amt_agg_tbl.head()

,Unnamed: 1,Fully Paid Claim,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension
0,ID10010854159,23227.94,0.0,0.0,0.0,0.0,0.0
1,ID10013863216,18282.46,0.0,0.0,0.0,0.0,0.0
2,ID10024447278,3126.90,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,136843.88,137.0,0.0,137.0,0.0,0.0
4,ID1003386406,76559.83,0.0,0.0,0.0,0.0,0.0

In [231]:
amt_agg_tbl.shape

(13910, 7)

In [232]:
amt_agg_tbl = amt_agg_tbl.rename(columns={"Unnamed: 1":"id","Fully Paid Claim":"Total_Amt_FPC"})

In [233]:
amt_agg_tbl.head()

,id,Total_Amt_FPC,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension
0,ID10010854159,23227.94,0.0,0.0,0.0,0.0,0.0
1,ID10013863216,18282.46,0.0,0.0,0.0,0.0,0.0
2,ID10024447278,3126.90,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,136843.88,137.0,0.0,137.0,0.0,0.0
4,ID1003386406,76559.83,0.0,0.0,0.0,0.0,0.0

In [234]:
amt_agg_tbl = amt_agg_tbl.rename(columns={"Unnamed: 1":"id","Fully Paid Claim":"Total_Amt_FPC",
                                          "New diagnosis - CAD":"Total_Amt_CAD",
                                          "New diagnosis - CHF":"Total_Amt_CHF",
                                          "New diagnosis - CPD":"Total_Amt_CPD",
                                          "New diagnosis - Diabetes":"Total_Amt_Diabetes",
                                          "New diagnosis - Hypertension": "Total_Amt_Hypertension"})

In [235]:
amt_agg_tbl.head()

,id,Total_Amt_FPC,Total_Amt_CAD,Total_Amt_CHF,Total_Amt_CPD,Total_Amt_Diabetes,Total_Amt_Hypertension
0,ID10010854159,23227.94,0.0,0.0,0.0,0.0,0.0
1,ID10013863216,18282.46,0.0,0.0,0.0,0.0,0.0
2,ID10024447278,3126.90,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,136843.88,137.0,0.0,137.0,0.0,0.0
4,ID1003386406,76559.83,0.0,0.0,0.0,0.0,0.0

In [252]:
amt_agg_tbl.shape

(13910, 7)

In [253]:
joined_tbl = joined_tbl_2.merge(amt_agg_tbl, on="id", how="outer")

In [254]:
joined_tbl.shape

(13990, 18)

In [255]:
joined_tbl.head()

,id,Fully Paid Claim,Inbound Call by Mbr,Inbound Call by Prov,New diagnosis - CAD,New diagnosis - CHF,New diagnosis - CPD,New diagnosis - Diabetes,New diagnosis - Hypertension,Surgery,Most_Recent_Day_Surgery,Avg_Amt_Spent_Surgery,Total_Amt_FPC,Total_Amt_CAD,Total_Amt_CHF,Total_Amt_CPD,Total_Amt_Diabetes,Total_Amt_Hypertension
0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0,-421,2314.0,23227.94,0.0,0.0,0.0,0.0,0.0
1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,-200,12337.42,18282.46,0.0,0.0,0.0,0.0,0.0
2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,3126.90,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0,-742,50042.33,136843.88,137.0,0.0,137.0,0.0,0.0
4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,76559.83,0.0,0.0,0.0,0.0,0.0

In [256]:
joined_tbl = joined_tbl.rename(columns={"Fully Paid Claim":"#_of_FPC","Inbound Call by Mbr":"#_of_InbCall_Mrb",
                                          "Inbound Call by Prov":"#_of_InbCall_Prov",
                                          "New diagnosis - CAD":"#_of_CAD",
                                          "New diagnosis - CHF":"#_of_CHF",
                                          "New diagnosis - CPD":"#_of_CPD",
                                          "New diagnosis - Diabetes":"#_of_Diabetes",
                                          "New diagnosis - Hypertension": "#_of_Hypertension",
                                          "Surgery": "#_of_Surgery"})

In [257]:
joined_tbl.head()

,id,#_of_FPC,#_of_InbCall_Mrb,#_of_InbCall_Prov,#_of_CAD,#_of_CHF,#_of_CPD,#_of_Diabetes,#_of_Hypertension,#_of_Surgery,Most_Recent_Day_Surgery,Avg_Amt_Spent_Surgery,Total_Amt_FPC,Total_Amt_CAD,Total_Amt_CHF,Total_Amt_CPD,Total_Amt_Diabetes,Total_Amt_Hypertension
0,ID10010854159,43.0,26.0,8.0,0.0,0.0,0.0,0.0,0.0,1.0,-421,2314.0,23227.94,0.0,0.0,0.0,0.0,0.0
1,ID10013863216,19.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,-200,12337.42,18282.46,0.0,0.0,0.0,0.0,0.0
2,ID10024447278,21.0,18.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,3126.90,0.0,0.0,0.0,0.0,0.0
3,ID1002482139,149.0,6.0,5.0,1.0,0.0,1.0,0.0,0.0,1.0,-742,50042.33,136843.88,137.0,0.0,137.0,0.0,0.0
4,ID1003386406,48.0,0.0,4.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,76559.83,0.0,0.0,0.0,0.0,0.0

In [258]:
joined_tbl.shape

(13990, 18)

In [259]:
joined_tbl.to_csv('/Users/Janey_jiayan/Downloads/Humana_Data/joined_tbl.csv')